{"pages":[{"title":"","text":"/*! * Start Bootstrap - Resume v6.0.1 (https://startbootstrap.com/template-overviews/resume) * Copyright 2013-2020 Start Bootstrap * Licensed under MIT (https://github.com/StartBootstrap/startbootstrap-resume/blob/master/LICENSE) */ !function(e){\"use strict\";e('a.js-scroll-trigger[href*=\"#\"]:not([href=\"#\"])').click((function(){if(location.pathname.replace(/^\\//,\"\")==this.pathname.replace(/^\\//,\"\")&&location.hostname==this.hostname){var t=e(this.hash);if((t=t.length?t:e(\"[name=\"+this.hash.slice(1)+\"]\")).length)return e(\"html, body\").animate({scrollTop:t.offset().top},1e3,\"easeInOutExpo\"),!1}})),e(\".js-scroll-trigger\").click((function(){e(\".navbar-collapse\").collapse(\"hide\")})),e(\"body\").scrollspy({target:\"#sideNav\"})}(jQuery);","link":"/about/js/scripts.js"},{"title":"","text":"Resume Shoichi Ishida About Skills Developments Research Interests Research Papers Conferences Articles Shoichi Ishida Graduate School of Pharmaceutical Sciences · Kyoto University I mainly studied pharmacy as an undergraduate student, and I'm currently studying cheminformatics, bioinformatics, and computer science as a Ph.D. student. I write blog posts related to my researches and life hacks on my web site. Skills Programming Languages & Tools Qualifications Pharmacist Developments ReTReK: data-driven ReTrosynthesis planning application using Retrosynthesis Knowledge [GitHub] DEFMap: Dynamics Extraction From cryo-EM Map [GitHub] kGCN: A graph-based deep learning framework for life science [GitHub] CompRet: a comprehensive recommendation framework for chemical synthesis planning with algorithmic enumeration [GitHub] Reaction template extractor [GitHub] Research Interests Computer-aided synthesis planning Application of machine learning for life sciences Cheminformatics Bioinformatics Research Papers Dagger (†) denotes these authors contributed equally. S. Matsumoto†, S. Ishida†, M. Araki, T. Kato, K. Terayama, Y. Okuno, Extraction of protein dynamics information from cryo-EM maps using deep learning, Nature Machine Intelligence, 2021 S. Ishida, K. Terayama, R. Kojima, K. Takasu, Y. Okuno, Prediction and Interpretable Visualization of Retrosynthetic Reactions Using Graph Convolutional Networks, Journal of Chemical Information and Modeling, 2019 R. Kojima, S. Ishida, M. Ohta, H. Iwata, T. Honma, Y. Okuno, kGCN: a graph-based deep learning framework for chemical structures, Journal of Cheminformatics, 2020 R. Shibukawa†, S. Ishida†, K. Yoshizoe, K. Wasa, K. Takasu, Y. Okuno, K. Terayama, K. Tsuda, CompRet: A comprehensive recommendation framework for chemical synthesis planning with algorithmic enumeration, Journal of Cheminformatics, 2020 S. Ishida, K. Terayama, R. Kojima, K. Takasu, Y. Okuno, AI-Driven Synthetic Route Design with Retrosynthesis Knowledge, ChemRxiv, 2020 Conferences International Conferences and Workshops R. Kojima, H. Iwata, S. Ishida, M. Ikeguchi, Y. Okuno; A Prediction Framework for Drug Discovery Using Graph Convolutional Networks; 5th International Symposium for Medicinal Sciences (ISMS) (poster), March, 2019. Domestic Conferences and Workshops S. Ishida, K. Terayama, R. Kojima, K. Takasu, Y. Okuno; Interpretable Reaction Prediction using Graph Convolutional Networks; CBI Annual Meeting, 2019/10/22~24, (oral) S. Ishida, K. Terayama, R. Kojima, K. Takasu, Y. Okuno; GCN 記述子とモンテカルロ木探索を用いた合成経路予測; CBI Annual Meeting, 2019/10/22~24, (oral: sponsored session) M. Ikeguchi, S. Ishida, R. Kojima, H. Iwata, Y. Okuno; Prediction of Compound-Protein Interactions and Visualization Based on Graph Convolutional Networks; CBI Annual Meeting, 2019/10/22~24, (poster) R. Shibukawa, S. Ishida, K. Terayama, K. Yoshizoe, Y. Okuno, K. Tsuda; 証明数探索を用いた化合物合成経路列挙アルゴリズム; Information-Based Induction Sciences (IBIS), 2018/11. (oral) Review Articles 寺山慧, 石田祥一, 奥野恭史, 『AIによる逆合成解析に向けて』, 月刊「細胞」, Vol.51, No.7, pp.12-15, 2019/5. 寺山慧, 石田祥一, 奥野恭史, 『囲碁AIから逆合成解析へ−情報科学からのアプローチ』, 化学, Vol.74 No.2, pp.36-40, 2019/1.","link":"/about/index.html"}],"posts":[],"tags":[],"categories":[]}